<details>
<summary>Terraform Plan</summary>

```
module.repository_br_cluster_manifests.data.github_team.br_owners: Reading...
module.repository_uniso.data.github_team.br_contributors: Reading...
module.repository_br_cluster_manifests.data.github_team.br_maintainers: Reading...
module.repository_br_cluster_provisioner.data.github_team.br_contributors: Reading...
module.repository_br_cluster_provisioner.data.github_team.br_owners: Reading...
module.repository_aws_shortcut_generator.data.github_team.br_owners: Reading...
module.repository_prompts.data.github_team.br_owners: Reading...
module.repository_br_claude_plugins.data.github_team.br_contributors: Reading...
module.repository_br_cluster_manifests.github_repository.this: Refreshing state... [id=br-cluster-manifests]
module.repository_prompts.github_repository.this: Refreshing state... [id=prompts]
module.repository_prompts.data.github_team.br_maintainers: Reading...
module.repository_br_cluster_imager.github_repository.this: Refreshing state... [id=br-cluster-imager]
module.repository_br_cluster_manifests.data.github_team.br_owners: Read complete after 4s [id=16658447]
module.repository_br_cluster_provisioner.data.github_team.br_maintainers: Reading...
module.repository_uniso.data.github_team.br_contributors: Read complete after 4s [id=16658449]
module.repository_idem.data.github_team.br_owners: Reading...
module.repository_prompts.data.github_team.br_owners: Read complete after 5s [id=16658447]
module.repository_aws_shortcut_generator.github_repository.this: Refreshing state... [id=aws-shortcut-generator]
module.repository_aws_shortcut_generator.data.github_team.br_owners: Read complete after 5s [id=16658447]
module.repository_idem.data.github_team.br_contributors: Reading...
module.repository_br_cluster_manifests.data.github_team.br_maintainers: Read complete after 5s [id=16658450]
module.repository_idem.data.github_team.br_maintainers: Reading...
module.repository_br_cluster_provisioner.data.github_team.br_contributors: Read complete after 6s [id=16658449]
module.repository_br_claude_plugins.github_repository.this: Refreshing state... [id=claude-dev-workflow]
module.repository_br_cluster_provisioner.data.github_team.br_owners: Read complete after 6s [id=16658447]
module.repository_idem.github_repository.this: Refreshing state... [id=idem]
module.repository_br_claude_plugins.data.github_team.br_contributors: Read complete after 6s [id=16658449]
module.repository_prompts.data.github_team.br_contributors: Reading...
module.repository_uniso.data.github_team.br_owners: Reading...
module.repository_endpoint_gate.github_repository.this: Refreshing state... [id=endpoint-gate]
module.repository_aws_shortcut_generator.data.github_team.br_contributors: Reading...
module.repository_br_cluster_provisioner.github_repository.this: Refreshing state... [id=br-cluster-provisioner]
module.repository_prompts.data.github_team.br_maintainers: Read complete after 6s [id=16658450]
module.repository_br_cluster_imager.data.github_team.br_contributors: Reading...
module.repository_br_cluster_provisioner.data.github_team.br_maintainers: Read complete after 7s [id=16658450]
module.repository_br_cluster_manifests.data.github_team.br_contributors: Reading...
module.repository_idem.data.github_team.br_owners: Read complete after 7s [id=16658447]
module.repository_br_claude_plugins.data.github_team.br_owners: Reading...
module.repository_idem.data.github_team.br_contributors: Read complete after 6s [id=16658449]
module.repository_br_claude_plugins.data.github_team.br_maintainers: Reading...
module.repository_idem.data.github_team.br_maintainers: Read complete after 7s [id=16658450]
module.repository_uniso.github_repository.this: Refreshing state... [id=uniso]
module.repository_prompts.data.github_team.br_contributors: Read complete after 6s [id=16658449]
module.repository_endpoint_gate.data.github_team.br_contributors: Reading...
module.repository_aws_shortcut_generator.data.github_team.br_maintainers: Reading...
module.repository_br_cluster_imager.data.github_team.br_maintainers: Reading...
module.repository_uniso.data.github_team.br_owners: Read complete after 7s [id=16658447]
module.repository_br_cluster_imager.data.github_team.br_owners: Reading...
module.repository_endpoint_gate.data.github_team.br_owners: Reading...
module.repository_aws_shortcut_generator.data.github_team.br_contributors: Read complete after 6s [id=16658449]
module.repository_endpoint_gate.data.github_team.br_maintainers: Reading...
module.repository_br_cluster_imager.data.github_team.br_contributors: Read complete after 7s [id=16658449]
module.repository_uniso.data.github_team.br_maintainers: Reading...
module.repository_br_cluster_manifests.data.github_team.br_contributors: Read complete after 6s [id=16658449]
module.repository_prompts.github_issue_labels.this: Refreshing state... [id=prompts]
module.repository_br_claude_plugins.data.github_team.br_owners: Read complete after 6s [id=16658447]
module.repository_prompts.github_repository_ruleset.required_signatures["branch"]: Refreshing state... [id=14179636]
module.repository_br_claude_plugins.data.github_team.br_maintainers: Read complete after 7s [id=16658450]
module.repository_prompts.github_repository_ruleset.required_signatures["tag"]: Refreshing state... [id=14179640]
module.repository_endpoint_gate.data.github_team.br_contributors: Read complete after 7s [id=16658449]
module.repository_br_cluster_manifests.github_repository_ruleset.required_signatures["tag"]: Refreshing state... [id=14179637]
module.repository_br_cluster_manifests.github_repository_ruleset.required_signatures["branch"]: Refreshing state... [id=14179630]
module.repository_br_cluster_manifests.github_issue_labels.this: Refreshing state... [id=br-cluster-manifests]
module.repository_aws_shortcut_generator.data.github_team.br_maintainers: Read complete after 7s [id=16658450]
module.repository_br_cluster_imager.github_issue_labels.this: Refreshing state... [id=br-cluster-imager]
module.repository_br_cluster_imager.github_repository_ruleset.required_signatures["tag"]: Refreshing state... [id=14179646]
module.repository_br_cluster_imager.data.github_team.br_maintainers: Read complete after 6s [id=16658450]
module.repository_br_cluster_imager.github_repository_ruleset.required_signatures["branch"]: Refreshing state... [id=14179644]
module.repository_aws_shortcut_generator.github_issue_labels.this: Refreshing state... [id=aws-shortcut-generator]
module.repository_br_cluster_imager.data.github_team.br_owners: Read complete after 6s [id=16658447]
module.repository_aws_shortcut_generator.github_repository_ruleset.required_signatures["branch"]: Refreshing state... [id=14179639]
module.repository_aws_shortcut_generator.github_repository_ruleset.required_signatures["tag"]: Refreshing state... [id=14179631]
module.repository_br_claude_plugins.github_actions_organization_variable_repository.this["CHLOE_CHAN_APP_ID"]: Refreshing state... [id=CHLOE_CHAN_APP_ID:1194776460]
module.repository_br_claude_plugins.github_actions_organization_secret_repository.this["CHLOE_CHAN_APP_PRIVATE_KEY"]: Refreshing state... [id=CHLOE_CHAN_APP_PRIVATE_KEY:1194776460]
module.repository_br_claude_plugins.github_repository_ruleset.required_signatures["branch"]: Refreshing state... [id=14465772]
module.repository_endpoint_gate.data.github_team.br_owners: Read complete after 6s [id=16658447]
module.repository_br_claude_plugins.github_repository_ruleset.required_signatures["tag"]: Refreshing state... [id=14465769]
module.repository_endpoint_gate.data.github_team.br_maintainers: Read complete after 6s [id=16658450]
module.repository_br_claude_plugins.github_issue_labels.this: Refreshing state... [id=claude-dev-workflow]
module.repository_idem.github_issue_labels.this: Refreshing state... [id=idem]
module.repository_idem.github_repository_ruleset.required_signatures["branch"]: Refreshing state... [id=14179635]
module.repository_uniso.data.github_team.br_maintainers: Read complete after 6s [id=16658450]
module.repository_idem.github_repository_ruleset.required_signatures["tag"]: Refreshing state... [id=14179642]
module.repository_idem.github_actions_organization_variable_repository.this["CHLOE_CHAN_APP_ID"]: Refreshing state... [id=CHLOE_CHAN_APP_ID:1178045510]
module.repository_idem.github_actions_organization_secret_repository.this["CHLOE_CHAN_APP_PRIVATE_KEY"]: Refreshing state... [id=CHLOE_CHAN_APP_PRIVATE_KEY:1178045510]
module.repository_endpoint_gate.github_repository_ruleset.required_signatures["tag"]: Refreshing state... [id=14179634]
module.repository_endpoint_gate.github_repository_ruleset.required_signatures["branch"]: Refreshing state... [id=14179641]
module.repository_endpoint_gate.github_actions_organization_secret_repository.this["SONATYPE_CENTRAL_PASSWORD"]: Refreshing state... [id=SONATYPE_CENTRAL_PASSWORD:1175625101]
module.repository_endpoint_gate.github_actions_organization_secret_repository.this["SONATYPE_CENTRAL_USERNAME"]: Refreshing state... [id=SONATYPE_CENTRAL_USERNAME:1175625101]
module.repository_endpoint_gate.github_actions_organization_secret_repository.this["PGP_SIGNING_KEY"]: Refreshing state... [id=PGP_SIGNING_KEY:1175625101]
module.repository_endpoint_gate.github_actions_organization_secret_repository.this["PGP_SIGNING_KEY_PASSPHRASE"]: Refreshing state... [id=PGP_SIGNING_KEY_PASSPHRASE:1175625101]
module.repository_endpoint_gate.github_issue_labels.this: Refreshing state... [id=endpoint-gate]
module.repository_br_cluster_provisioner.github_issue_labels.this: Refreshing state... [id=br-cluster-provisioner]
module.repository_br_cluster_provisioner.github_repository_ruleset.required_signatures["branch"]: Refreshing state... [id=14179633]
module.repository_br_cluster_provisioner.github_repository_ruleset.required_signatures["tag"]: Refreshing state... [id=14179638]
module.repository_uniso.github_actions_organization_variable_repository.this["CHLOE_CHAN_APP_ID"]: Refreshing state... [id=CHLOE_CHAN_APP_ID:1186264710]
module.repository_uniso.github_issue_labels.this: Refreshing state... [id=uniso]
module.repository_uniso.github_repository_ruleset.required_signatures["branch"]: Refreshing state... [id=14179632]
module.repository_uniso.github_repository_ruleset.required_signatures["tag"]: Refreshing state... [id=14179643]
module.repository_uniso.github_actions_organization_secret_repository.this["CHLOE_CHAN_APP_PRIVATE_KEY"]: Refreshing state... [id=CHLOE_CHAN_APP_PRIVATE_KEY:1186264710]
module.repository_br_cluster_manifests.github_repository_ruleset.protect_tags: Refreshing state... [id=14203506]
module.repository_br_cluster_manifests.github_repository_ruleset.default_branch[0]: Refreshing state... [id=13928512]
module.repository_prompts.github_repository_ruleset.protect_tags: Refreshing state... [id=14203508]
module.repository_prompts.github_repository_ruleset.default_branch[0]: Refreshing state... [id=13959874]
module.repository_aws_shortcut_generator.github_repository_ruleset.protect_tags: Refreshing state... [id=14203504]
module.repository_aws_shortcut_generator.github_repository_ruleset.default_branch[0]: Refreshing state... [id=13928519]
module.repository_br_cluster_provisioner.github_repository_ruleset.default_branch[0]: Refreshing state... [id=13928518]
module.repository_br_cluster_provisioner.github_repository_ruleset.protect_tags: Refreshing state... [id=14203510]
module.repository_br_cluster_provisioner.github_team_repository.this["16658449"]: Refreshing state... [id=16658449:br-cluster-provisioner]
module.repository_br_cluster_provisioner.github_team_repository.this["16658447"]: Refreshing state... [id=16658447:br-cluster-provisioner]
module.repository_br_cluster_provisioner.github_team_repository.this["16658450"]: Refreshing state... [id=16658450:br-cluster-provisioner]
module.repository_idem.github_repository_ruleset.protect_tags: Refreshing state... [id=14203509]
module.repository_idem.github_repository_ruleset.default_branch[0]: Refreshing state... [id=13928509]
module.repository_idem.github_team_repository.this["16658450"]: Refreshing state... [id=16658450:idem]
module.repository_idem.github_team_repository.this["16658449"]: Refreshing state... [id=16658449:idem]
module.repository_idem.github_team_repository.this["16658447"]: Refreshing state... [id=16658447:idem]
module.repository_prompts.github_team_repository.this["16658447"]: Refreshing state... [id=16658447:prompts]
module.repository_prompts.github_team_repository.this["16658449"]: Refreshing state... [id=16658449:prompts]
module.repository_prompts.github_team_repository.this["16658450"]: Refreshing state... [id=16658450:prompts]
module.repository_uniso.github_repository_ruleset.protect_tags: Refreshing state... [id=14203514]
module.repository_uniso.github_repository_ruleset.default_branch[0]: Refreshing state... [id=14110232]
module.repository_br_cluster_manifests.github_team_repository.this["16658449"]: Refreshing state... [id=16658449:br-cluster-manifests]
module.repository_br_cluster_manifests.github_team_repository.this["16658450"]: Refreshing state... [id=16658450:br-cluster-manifests]
module.repository_br_cluster_manifests.github_team_repository.this["16658447"]: Refreshing state... [id=16658447:br-cluster-manifests]
module.repository_br_claude_plugins.github_repository_ruleset.protect_tags: Refreshing state... [id=14465770]
module.repository_br_claude_plugins.github_repository_ruleset.default_branch[0]: Refreshing state... [id=14465771]
module.repository_br_claude_plugins.github_team_repository.this["16658447"]: Refreshing state... [id=16658447:claude-dev-workflow]
module.repository_br_claude_plugins.github_team_repository.this["16658450"]: Refreshing state... [id=16658450:claude-dev-workflow]
module.repository_br_claude_plugins.github_team_repository.this["16658449"]: Refreshing state... [id=16658449:claude-dev-workflow]
module.repository_aws_shortcut_generator.github_team_repository.this["16658447"]: Refreshing state... [id=16658447:aws-shortcut-generator]
module.repository_aws_shortcut_generator.github_team_repository.this["16658449"]: Refreshing state... [id=16658449:aws-shortcut-generator]
module.repository_aws_shortcut_generator.github_team_repository.this["16658450"]: Refreshing state... [id=16658450:aws-shortcut-generator]
module.repository_br_cluster_imager.github_repository_ruleset.protect_tags: Refreshing state... [id=14203513]
module.repository_br_cluster_imager.github_repository_ruleset.default_branch[0]: Refreshing state... [id=13928514]
module.repository_br_cluster_imager.github_team_repository.this["16658449"]: Refreshing state... [id=16658449:br-cluster-imager]
module.repository_br_cluster_imager.github_team_repository.this["16658447"]: Refreshing state... [id=16658447:br-cluster-imager]
module.repository_br_cluster_imager.github_team_repository.this["16658450"]: Refreshing state... [id=16658450:br-cluster-imager]
module.repository_endpoint_gate.github_repository_ruleset.default_branch[0]: Refreshing state... [id=13928516]
module.repository_endpoint_gate.github_repository_ruleset.protect_tags: Refreshing state... [id=14203503]
module.repository_endpoint_gate.github_team_repository.this["16658449"]: Refreshing state... [id=16658449:endpoint-gate]
module.repository_endpoint_gate.github_team_repository.this["16658450"]: Refreshing state... [id=16658450:endpoint-gate]
module.repository_endpoint_gate.github_team_repository.this["16658447"]: Refreshing state... [id=16658447:endpoint-gate]
module.repository_uniso.github_team_repository.this["16658447"]: Refreshing state... [id=16658447:uniso]
module.repository_uniso.github_team_repository.this["16658450"]: Refreshing state... [id=16658450:uniso]
module.repository_uniso.github_team_repository.this["16658449"]: Refreshing state... [id=16658449:uniso]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  ~ update in-place
-/+ destroy and then create replacement

Terraform will perform the following actions:

  # module.repository_claude_dev_workflow.github_actions_organization_secret_repository.this["CHLOE_CHAN_APP_PRIVATE_KEY"] has moved to module.repository_br_claude_plugins.github_actions_organization_secret_repository.this["CHLOE_CHAN_APP_PRIVATE_KEY"]
    resource "github_actions_organization_secret_repository" "this" {
        id            = "CHLOE_CHAN_APP_PRIVATE_KEY:1194776460"
        # (2 unchanged attributes hidden)
    }

  # module.repository_claude_dev_workflow.github_actions_organization_variable_repository.this["CHLOE_CHAN_APP_ID"] has moved to module.repository_br_claude_plugins.github_actions_organization_variable_repository.this["CHLOE_CHAN_APP_ID"]
    resource "github_actions_organization_variable_repository" "this" {
        id            = "CHLOE_CHAN_APP_ID:1194776460"
        # (2 unchanged attributes hidden)
    }

  # module.repository_br_claude_plugins.github_issue_labels.this must be replaced
  # (moved from module.repository_claude_dev_workflow.github_issue_labels.this)
-/+ resource "github_issue_labels" "this" {
      ~ id         = "claude-dev-workflow" -> (known after apply)
      ~ repository = "claude-dev-workflow" -> "br-claude-plugins" # forces replacement

      - label {
          - color       = "008000" -> null
          - description = "テスト追加・修正" -> null
          - name        = "Kind: Tests" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Kind:%20Tests" -> null
        }
      - label {
          - color       = "00bfff" -> null
          - description = "新機能" -> null
          - name        = "Kind: Feature" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Kind:%20Feature" -> null
        }
      - label {
          - color       = "40e0d0" -> null
          - description = "ドキュメント追加・修正" -> null
          - name        = "Kind: Documentation" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Kind:%20Documentation" -> null
        }
      - label {
          - color       = "4169e1" -> null
          - description = "優先度：低" -> null
          - name        = "Priority: Low" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Priority:%20Low" -> null
        }
      - label {
          - color       = "859179" -> null
          - description = "リリースノートへの記載しない" -> null
          - name        = "Meta: Release note ignored" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Meta:%20Release%20note%20ignored" -> null
        }
      - label {
          - color       = "89058a" -> null
          - description = "機能強化" -> null
          - name        = "Kind: Enhancement" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Kind:%20Enhancement" -> null
        }
      - label {
          - color       = "b60205" -> null
          - description = "優先度：緊急" -> null
          - name        = "Priority: Critical" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Priority:%20Critical" -> null
        }
      - label {
          - color       = "b60205" -> null
          - description = "破壊的変更を含み、後方互換性が失われるような対応" -> null
          - name        = "Impact: Breaking" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Impact:%20Breaking" -> null
        }
      - label {
          - color       = "da70d6" -> null
          - description = "Q＆A" -> null
          - name        = "Type: Question" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Type:%20Question" -> null
        }
      - label {
          - color       = "da70d6" -> null
          - description = "他者のヘルプを求む" -> null
          - name        = "Need: Help Wanted" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Need:%20Help%20Wanted" -> null
        }
      - label {
          - color       = "da70d6" -> null
          - description = "議論が必要" -> null
          - name        = "Need: Discussion" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Need:%20Discussion" -> null
        }
      - label {
          - color       = "dcdcdc" -> null
          - description = "対応しない" -> null
          - name        = "Close: WontFix" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Close:%20WontFix" -> null
        }
      - label {
          - color       = "dcdcdc" -> null
          - description = "誤り" -> null
          - name        = "Close: Invalid" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Close:%20Invalid" -> null
        }
      - label {
          - color       = "dcdcdc" -> null
          - description = "重複しているもの(他のIssueやpull requestで対応する)" -> null
          - name        = "Close: Duplicate" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Close:%20Duplicate" -> null
        }
      - label {
          - color       = "ededed" -> null
          - description = "依存ライブラリのアップデート" -> null
          - name        = "Kind: Dependencies" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Kind:%20Dependencies" -> null
        }
      - label {
          - color       = "fa8072" -> null
          - description = "内部的なリファクタリング(APIの破壊的変更を伴わない範囲)" -> null
          - name        = "Kind: Refactoring" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Kind:%20Refactoring" -> null
        }
      - label {
          - color       = "ff0000" -> null
          - description = "バグ関連" -> null
          - name        = "Kind: Bug Fix" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Kind:%20Bug%20Fix" -> null
        }
      - label {
          - color       = "ff4500" -> null
          - description = "優先度：高" -> null
          - name        = "Priority: High" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Priority:%20High" -> null
        }
      - label {
          - color       = "ffd700" -> null
          - description = "優先度：中" -> null
          - name        = "Priority: Medium" -> null
          - url         = "https://api.github.com/repos/bright-room/claude-dev-workflow/labels/Priority:%20Medium" -> null
        }
      + label {
          + color       = "008000"
          + description = "テスト追加・修正"
          + name        = "Kind: Tests"
          + url         = (known after apply)
        }
      + label {
          + color       = "00bfff"
          + description = "新機能"
          + name        = "Kind: Feature"
          + url         = (known after apply)
        }
      + label {
          + color       = "40e0d0"
          + description = "ドキュメント追加・修正"
          + name        = "Kind: Documentation"
          + url         = (known after apply)
        }
      + label {
          + color       = "4169e1"
          + description = "優先度：低"
          + name        = "Priority: Low"
          + url         = (known after apply)
        }
      + label {
          + color       = "859179"
          + description = "リリースノートへの記載しない"
          + name        = "Meta: Release note ignored"
          + url         = (known after apply)
        }
      + label {
          + color       = "89058a"
          + description = "機能強化"
          + name        = "Kind: Enhancement"
          + url         = (known after apply)
        }
      + label {
          + color       = "b60205"
          + description = "優先度：緊急"
          + name        = "Priority: Critical"
          + url         = (known after apply)
        }
      + label {
          + color       = "b60205"
          + description = "破壊的変更を含み、後方互換性が失われるような対応"
          + name        = "Impact: Breaking"
          + url         = (known after apply)
        }
      + label {
          + color       = "da70d6"
          + description = "Q＆A"
          + name        = "Type: Question"
          + url         = (known after apply)
        }
      + label {
          + color       = "da70d6"
          + description = "他者のヘルプを求む"
          + name        = "Need: Help Wanted"
          + url         = (known after apply)
        }
      + label {
          + color       = "da70d6"
          + description = "議論が必要"
          + name        = "Need: Discussion"
          + url         = (known after apply)
        }
      + label {
          + color       = "dcdcdc"
          + description = "対応しない"
          + name        = "Close: WontFix"
          + url         = (known after apply)
        }
      + label {
          + color       = "dcdcdc"
          + description = "誤り"
          + name        = "Close: Invalid"
          + url         = (known after apply)
        }
      + label {
          + color       = "dcdcdc"
          + description = "重複しているもの(他のIssueやpull requestで対応する)"
          + name        = "Close: Duplicate"
          + url         = (known after apply)
        }
      + label {
          + color       = "ededed"
          + description = "依存ライブラリのアップデート"
          + name        = "Kind: Dependencies"
          + url         = (known after apply)
        }
      + label {
          + color       = "fa8072"
          + description = "内部的なリファクタリング(APIの破壊的変更を伴わない範囲)"
          + name        = "Kind: Refactoring"
          + url         = (known after apply)
        }
      + label {
          + color       = "ff0000"
          + description = "バグ関連"
          + name        = "Kind: Bug Fix"
          + url         = (known after apply)
        }
      + label {
          + color       = "ff4500"
          + description = "優先度：高"
          + name        = "Priority: High"
          + url         = (known after apply)
        }
      + label {
          + color       = "ffd700"
          + description = "優先度：中"
          + name        = "Priority: Medium"
          + url         = (known after apply)
        }
    }

  # module.repository_br_claude_plugins.github_repository.this will be updated in-place
  # (moved from module.repository_claude_dev_workflow.github_repository.this)
  ~ resource "github_repository" "this" {
      ~ description                             = "Shared Claude Code skills for plan, implement, review, and triage — a reusable development workflow across repositories." -> "Shared Claude Code plugins — reusable skills and commands across bright-room repositories."
      ~ full_name                               = "bright-room/claude-dev-workflow" -> (known after apply)
        id                                      = "claude-dev-workflow"
      ~ name                                    = "claude-dev-workflow" -> "br-claude-plugins"
      ~ topics                                  = [
          - "developer-workflow",
          - "sdlc",
          + "claude-plugins",
            # (2 unchanged elements hidden)
        ]
        # (39 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.repository_br_claude_plugins.github_repository_ruleset.default_branch[0] will be updated in-place
  # (moved from module.repository_claude_dev_workflow.github_repository_ruleset.default_branch[0])
  ~ resource "github_repository_ruleset" "default_branch" {
        id          = "14465771"
        name        = "protect-default-branch"
      ~ repository  = "claude-dev-workflow" -> "br-claude-plugins"
        # (5 unchanged attributes hidden)

        # (5 unchanged blocks hidden)
    }

  # module.repository_br_claude_plugins.github_repository_ruleset.protect_tags will be updated in-place
  # (moved from module.repository_claude_dev_workflow.github_repository_ruleset.protect_tags)
  ~ resource "github_repository_ruleset" "protect_tags" {
        id          = "14465770"
        name        = "protect-tags"
      ~ repository  = "claude-dev-workflow" -> "br-claude-plugins"
        # (5 unchanged attributes hidden)

        # (4 unchanged blocks hidden)
    }

  # module.repository_br_claude_plugins.github_repository_ruleset.required_signatures["branch"] will be updated in-place
  # (moved from module.repository_claude_dev_workflow.github_repository_ruleset.required_signatures["branch"])
  ~ resource "github_repository_ruleset" "required_signatures" {
        id          = "14465772"
        name        = "require-signed-commits-branch"
      ~ repository  = "claude-dev-workflow" -> "br-claude-plugins"
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_br_claude_plugins.github_repository_ruleset.required_signatures["tag"] will be updated in-place
  # (moved from module.repository_claude_dev_workflow.github_repository_ruleset.required_signatures["tag"])
  ~ resource "github_repository_ruleset" "required_signatures" {
        id          = "14465769"
        name        = "require-signed-commits-tag"
      ~ repository  = "claude-dev-workflow" -> "br-claude-plugins"
        # (5 unchanged attributes hidden)

        # (2 unchanged blocks hidden)
    }

  # module.repository_br_claude_plugins.github_team_repository.this["16658447"] must be replaced
  # (moved from module.repository_claude_dev_workflow.github_team_repository.this["16658447"])
-/+ resource "github_team_repository" "this" {
      ~ etag       = "W/\"685d601800314602f9bf6fcb84073ef73ebae19cf86db3708733ad7c0dc2d8b6\"" -> (known after apply)
      ~ id         = "16658447:claude-dev-workflow" -> (known after apply)
      ~ repository = "claude-dev-workflow" -> "br-claude-plugins" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.repository_br_claude_plugins.github_team_repository.this["16658449"] must be replaced
  # (moved from module.repository_claude_dev_workflow.github_team_repository.this["16658449"])
-/+ resource "github_team_repository" "this" {
      ~ etag       = "W/\"b1d965fdb15057816258e72f3a2da5a06aae981c733f81eff7c2442c4da71e7e\"" -> (known after apply)
      ~ id         = "16658449:claude-dev-workflow" -> (known after apply)
      ~ repository = "claude-dev-workflow" -> "br-claude-plugins" # forces replacement
        # (2 unchanged attributes hidden)
    }

  # module.repository_br_claude_plugins.github_team_repository.this["16658450"] must be replaced
  # (moved from module.repository_claude_dev_workflow.github_team_repository.this["16658450"])
-/+ resource "github_team_repository" "this" {
      ~ etag       = "W/\"b7f70fdf523407ca6383d070171a1038611523e620fadd2603d2163d120cb6b2\"" -> (known after apply)
      ~ id         = "16658450:claude-dev-workflow" -> (known after apply)
      ~ repository = "claude-dev-workflow" -> "br-claude-plugins" # forces replacement
        # (2 unchanged attributes hidden)
    }

Plan: 4 to add, 5 to change, 4 to destroy.

─────────────────────────────────────────────────────────────────────────────

Note: You didn't use the -out option to save this plan, so Terraform can't
guarantee to take exactly these actions if you run "terraform apply" now.

```

</details>
